/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 7号电单车. 2017. All rights reserved.              */
/*                                                                            */
/* 文件名称: pub_xxtea.c                                                      */
/* 内容摘要: XXTEA加解密算法实现                                              */
/* 其它说明: 无                                                               */
/* 当前版本: V1.0                                                             */
/* 作    者: maag                                                             */
/* 完成日期: 2018-03-31                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号      修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2018-03-31        V1.0        maag            创建文件                 */
/*<FH->************************************************************************/


/******************************************************************************/
/*               #include（依次为标准库头文件、非标准库头文件）               */
/******************************************************************************/
#include <stdio.h>
#include <string.h>


/******************************************************************************/
/*                                外部引用声明                                */
/******************************************************************************/


/******************************************************************************/
/*                                 内部宏定义                                 */
/******************************************************************************/
#define MX                      (z>>5^y<<2)+(y>>3^z<<4)^(sum^y)+(k[p&3^e]^z)
#define DELTA                   0X9E3779B9

#define S_LOOPTIME              1
#define ENCRYPT_INT_BUFF        256 


/******************************************************************************/
/*                              内部数据类型定义                              */
/******************************************************************************/


/******************************************************************************/
/*                               全局(静态)变量                               */
/******************************************************************************/
static int sg_key_buff[4] = {0};
static int sg_data_buff[ENCRYPT_INT_BUFF] = {0};


/******************************************************************************/
/*                                内部函数原型                                */
/******************************************************************************/
static int bytes2int(unsigned char *bytes);
static void int2byte(int data, unsigned char *bytes);
static void TEA_EncryptCore(int block_size, int *buf, int *key);
static void TEA_DecrpytCore(int block_size, int *buf, int *key);


/******************************************************************************/
/*                                全局函数实现                                */
/******************************************************************************/
/*<FUNC+>**********************************************************************/
/* 函数名称: PUB_XxTEASetKey                                                  */
/* 功能描述: 设置XxTEA算法的密钥                                              */
/* 输入参数: key --- 指向秘钥的指针                                           */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
void PUB_XxTEASetKey(unsigned char* key)
{
    int i;

    for(i=0; i<4; i++)
    {
        sg_key_buff[i] = bytes2int(&key[i*4]);
    }
}

/*<FUNC+>**********************************************************************/
/* 函数名称: PUB_XxTEAEncrypt                                                 */
/* 功能描述: XXTEA加密算法实现                                                */
/* 输入参数: data --- 指向加密数据的指针                                      */
/*           data_size --- 加密数据长度                                       */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
int PUB_XxTEAEncrypt(unsigned char *data, unsigned short data_size)
{
    int i          = 0;
    int block_size = ((data_size + 2) / 4 + 1) * 4;

    memset(sg_data_buff, 0, ENCRYPT_INT_BUFF*4);

    if (block_size > data_size)
    {
        memset(&data[data_size], 0, block_size-data_size);
    }
    
    for (i=data_size+1; i>=2; i--)
    {
        data[i]= data[i-2];
    }
    
    data[0] = (data_size >>8)&0xff;
    data[1] = (data_size >>0)&0xff;

    for (i=0; i<block_size/4; i++)
    {
        sg_data_buff[i] = bytes2int(&data[i*4]);
    }
    
    TEA_EncryptCore(block_size, sg_data_buff, sg_key_buff);
    
    for (i=0; i<block_size/4; i++)
    {
        int2byte(sg_data_buff[i], &data[i*4]);
    }

    return block_size;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: PUB_XxTEADecrypt                                                 */
/* 功能描述: XxTEA解密算法实现                                                */
/* 输入参数: data --- 指向解密数据的指针                                      */
/*           data_size --- 解密数据长度                                       */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
int PUB_XxTEADecrypt(unsigned char* data, unsigned short data_size)
{
    int i;
    int real_data_size =0;

    memset(sg_data_buff, 0, ENCRYPT_INT_BUFF*4);
    
    for (i=0; i<data_size/4; i++)
    {
        sg_data_buff[i] = bytes2int(&data[i * 4]);
    }

    TEA_DecrpytCore(data_size, sg_data_buff, sg_key_buff); 

    for(i=0; i<data_size/4; i++)
    {
        int2byte(sg_data_buff[i], &data[i*4]);
    }

    real_data_size = ((int)data[0] << 8) | (int)data[1];

    if (real_data_size > data_size)
    {
        return 0;
    }

    for (i=0; i<real_data_size; i++)
    {
        data[i] = data[i +2];
    }

    return real_data_size;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: xxtea_test                                                       */
/* 功能描述: XXTEA算法测试                                                    */
/* 输入参数: 无                                                               */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
void xxtea_test(void)
{
    int len;
    unsigned char input[20] = {0x4F, 0x00, 0x87, 0x32, 0x87, 0xe4, 0x47, 0x3c,
                               0x15, 0x8e, 0x2e, 0x87, 0x3d, 0xaf, 0x65, 0xbd};
    unsigned char key[16]   = {0x87, 0x32, 0x87, 0xe4, 0x47, 0x3c, 0x15, 0x8e,
                               0x2e, 0x87, 0x3d, 0xaf, 0x65, 0xbd, 0x7b, 0xa8};

    PUB_XxTEASetKey(key);

    len = PUB_XxTEAEncrypt(input, 16);
    len = PUB_XxTEADecrypt(input, len);
}


/******************************************************************************/
/*                                内部函数实现                                */
/******************************************************************************/
/*<FUNC+>**********************************************************************/
/* 函数名称: bytes2int                                                        */
/* 功能描述: 字节转换为字                                                     */
/* 输入参数: bytes --- 指向字节流的指针                                       */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
static int bytes2int(unsigned char *bytes) 
{
    int result = bytes[0] & 0xFF;

    result |= ((bytes[1] << 8) & 0xFF00);
    result |= ((bytes[2] << 16) & 0xFF0000);
    result |= ((bytes[3] << 24) & 0xFF000000);

    return result;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: int2byte                                                         */
/* 功能描述: 字转换为字节                                                     */
/* 输入参数: data --- 要转换的字                                              */
/*           bytes --- 指向字节缓冲区的指针                                   */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
static void int2byte(int data, unsigned char *bytes) 
{
    bytes[0] = (unsigned char)(0xff & data);
    bytes[1] = (unsigned char)((0xff00 & data) >> 8);
    bytes[2] = (unsigned char)((0xff0000 & data) >> 16);
    bytes[3] = (unsigned char)((0xff000000 & data) >> 24);
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TEA_EncryptCore                                                  */
/* 功能描述: XXTEA加密核心算法                                                */
/* 输入参数: block_size --- 块大小                                            */
/*           buf --- 指向加密数据的指针                                       */
/*           key --- 指向秘钥的指针                                           */
/* 输出参数: 无                                                               */
/* 返 回 值: static void                                                      */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
static void TEA_EncryptCore(int block_size, int *buf, int *key)
{
    char n   = block_size /4;
    int *v   =(int*)buf;
    int *k   =(int*)key;
    long z   = v[n -1];
    long y   = v[0];
    long sum =0;
    long e;
    char p;
    char q;

    q = S_LOOPTIME + 52 / n;

    while (q-->0)
    {
        sum += DELTA;
        e = sum >> 2 & 3;

        for (p=0; p<(n-1); p++)
        {
            y = v[p + 1];
            z = v[p] += MX;
        }
        y = v[0];
        z = v[n - 1] += MX;
    }
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TEA_DecrpytCore                                                  */
/* 功能描述: XXTEA解密核心函数                                                */
/* 输入参数: block_size --- 块大小                                            */
/*           buf --- 指向解密数据的指针                                       */
/*           key --- 指向密钥的指针                                           */
/* 输出参数: 无                                                               */
/* 返 回 值: static void                                                      */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2018-03-31              V1.0          maag          创建函数           */
/*<FUNC->**********************************************************************/
static void TEA_DecrpytCore(int block_size, int *buf, int *key)
{
    char  n   = block_size /4;
    long *v   = (long*)buf;
    long *k   = (long*)key;
    long  z   = v[n -1];
    long  y   = v[0];
    long  sum = 0;
    long  e;
    unsigned char p;
    unsigned char q;

    q = S_LOOPTIME + 52 / n;
    sum = q * DELTA;

    while (sum !=0)
    {
        e = sum >> 2 & 3;

        for (p=(n -1); p>0; p--)
        {
            z = v[p - 1];
            y = v[p] -= MX;
        }
        z = v[n - 1];
        y = v[0] -= MX;
        sum -= DELTA;
    }
}


