/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 7号电单车. 2017. All rights reserved.              */
/*                                                                            */
/* 文件名称: pub_trace.c                                                      */
/* 内容摘要: TRACE功能的实现                                                  */
/* 其它说明: 无                                                               */
/* 当前版本: v0.9                                                             */
/* 作    者: maag                                                             */
/* 完成日期: 2017-11-23                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号      修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2017-11-23        v0.9        maag            创建文件                 */
/*<FH->************************************************************************/

#if defined(DEBUG) && defined(FT_TRC_EN)
/******************************************************************************/
/*               #include（依次为标准库头文件、非标准库头文件）               */
/******************************************************************************/
#include <string.h>
#include "pub_include.h"


/******************************************************************************/
/*                                外部引用声明                                */
/******************************************************************************/


/******************************************************************************/
/*                                 内部宏定义                                 */
/******************************************************************************/


/******************************************************************************/
/*                              内部数据类型定义                              */
/******************************************************************************/
/*<STRUCT+>********************************************************************/
/* 结构: T_FN_NAME                                                            */
/* 注释: 函数名栈的结构                                                       */
/*<STRUCT->********************************************************************/
typedef struct t_fn_name
{
    char fnName[TRC_MAX_NAME_SIZE];             /* 函数名称                   */
    char taskName[TRC_MAX_NAME_SIZE];           /* 执行当前函数的任务名称     */
    struct t_fn_name *pNext;                    /* 指向下一个函数名结构的指针 */

} T_FN_NAME;


/******************************************************************************/
/*                               全局(静态)变量                               */
/******************************************************************************/
T_FN_NAME *gTrcNameStk;                                 /* 函数名栈           */
OS_SEM     gTrcFnNameStkMutex        = USR_NULL;        /* 函数名栈信号量     */
OS_SEM     gTrcEvtMutex              = USR_NULL;        /* EVT TRACE信号量    */
U32        gTrcLevel                 = TRC_CUR_LVL;     /* EVT TRACE等级      */
U32        gTrcFilterCnts            = 2;               /* 过滤文件总数       */
char      *gTrcFilter[TRC_MAX_FILES] = {"tes","coms"};


/******************************************************************************/
/*                                内部函数原型                                */
/******************************************************************************/


/******************************************************************************/
/*                                全局函数实现                                */
/******************************************************************************/
/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_Init                                                       */
/* 功能描述: TRACE模块的初始化                                                */
/* 输入参数: 无                                                               */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-11-23              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
USR_STATUS TRACE_Init(void)
{
    USR_STATUS res = 0;

    /**************************************************************************/
    /* 创建用于操作函数名栈的信号量                                           */
    /**************************************************************************/
    gTrcFnNameStkMutex = OS_SemCreateMutex();
    if (USR_NULL == gTrcFnNameStkMutex)
    {
        gTrcLevel = TRC_LVL_NO;
        res = 1;
        goto EXIT_LABEL;
    }

    /**************************************************************************/
    /* 初始化函数名栈                                                         */
    /**************************************************************************/
    gTrcNameStk = USR_NULL;

    /**************************************************************************/
    /* evt trace初始化                                                        */
    /**************************************************************************/
    TRACE_EvtInit();

EXIT_LABEL:
    return res;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_EvtInit                                                    */
/* 功能描述: 初始化evt trace                                                  */
/* 输入参数: 无                                                               */
/* 输出参数: 无                                                               */
/* 返 回 值: USR_STATUS                                                       */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-12-19              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
USR_STATUS TRACE_EvtInit(void)
{
    USR_STATUS res = 0;
    T_RTC tSystime;

    /**************************************************************************/
    /* 创建操作evt trace的信号量                                              */
    /**************************************************************************/
    gTrcEvtMutex = OS_SemCreateMutex();
    if (USR_NULL == gTrcEvtMutex)
    {
        gTrcLevel = TRC_LVL_NO;
        res = 1;
        goto EXIT_LABEL;
    }

    if (TRC_LVL_NO != gTrcLevel)
    {
#if TRC_SIO
        BSP_RTCGetDateTime(&tSystime, RTC_FMT_BIN);
        TRC_OUT("ver: 1.00\r\ntracing start at %d-%d-%d %d-%d-%d\r\n",
                tSystime.year, tSystime.month, tSystime.day,
                tSystime.hours, tSystime.minutes, tSystime.seconds);
        TRC_OUT("%-20s %-5s %-12s %-16s %-24s %-10s\r\n",
                "file", "line", "time", "task", "function", "content");
        TRC_OUT("-------------------------------------------------------------"\
                "-------------------------------------------------------------");
#endif
    }

EXIT_LABEL:
    return res;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_GetSelfTaskName                                            */
/* 功能描述: 获取当前任务的名称                                               */
/* 输入参数: pTaskName --- 指向存放任务名称的指针                             */
/*           size --- 缓冲区大小                                              */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-12-19              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
void TRACE_GetSelfTaskName(char *pTaskName, U32 size)
{
    char *pName;

    if (USR_NULL != pTaskName)
    {
        pName = pcTaskGetName(0);
        strncpy(pTaskName, pName, TRC_MAX_NAME_SIZE-1);
        pTaskName[TRC_MAX_NAME_SIZE-1] = '\0';
    }

    return;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_GetFnNameInStk                                             */
/* 功能描述: 在函数名栈中查找函数名                                           */
/* 输入参数: pTaskName --- 任务名称                                           */
/* 输出参数: pFuncName --- 和任务名称匹配的第一个函数名                       */
/* 返 回 值: S32                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-12-19              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
S32 TRACE_GetFnNameInStk(const char *pTaskName, char *pFuncName)
{
    S32        res   = -1;
    T_FN_NAME *pName = USR_NULL;

    /**************************************************************************/
    /* 输入参数参数检查                                                       */
    /**************************************************************************/
    if (USR_NULL == pFuncName || USR_NULL == pTaskName)
    {
        goto EXIT_LABEL;
    }

    /**************************************************************************/
    /* 在函数名栈中查找第一个和任务名匹配的函数名                             */
    /**************************************************************************/
    pName = gTrcNameStk;

    while (NULL != pName)
    {
        USR_ASSERT((USR_NULL != pName) && (USR_NULL != pName->taskName));

        //res = strcmp(pTaskName, pName->taskName);
        res = memcmp(pTaskName, pName->taskName, strlen(pTaskName));

        if (0 == res)
        {
            strcpy(pFuncName, pName->fnName);
            break;
        }
        else
        {
            pName = pName->pNext;
        }
    }

    /**************************************************************************/
    /* 如果函数名堆栈中没有找到相应的函数名，则将输出参数以0赋空              */
    /**************************************************************************/
    if (0 != res)
    {
        pFuncName[0] = '\0';
    }

EXIT_LABEL:
    return res;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_FileFilter                                                 */
/* 功能描述: TRACE文件过滤检查。                                              */
/* 输入参数: pcFilePath --- 文件名路径                                        */
/* 输出参数: 无                                                               */
/* 返 回 值: 0 - 满足过滤条件；1 - 不满足过滤条件                             */
/* 操作流程:                                                                  */
/* 其它说明: 满足过滤条件表示可以输出TRACE信息。                              */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-11-23              v0.9          maag           创建函数          */
/*<FUNC->**********************************************************************/
USR_STATUS TRACE_FileFilter(const char *filePath)
{
    U32 ret = 1;
    U32 cnts;
    const char *fileName;

    /**************************************************************************/
    /* 过滤文件数为0，或是超过了最大过滤文件数，视为不过滤（即满足过滤条件）  */
    /**************************************************************************/
    if ((0 == gTrcFilterCnts) || (gTrcFilterCnts > TRC_MAX_FILES))
    {
        ret = 0;
    }
    /**************************************************************************/
    /* 过滤文件数不为0，那么只有在过滤列表中的文件才满足条件                  */
    /**************************************************************************/
    else
    {
        fileName = strrchr(filePath, '\\');

        if (0 == fileName)
        {
            fileName = strrchr(filePath, '/');
        }

        if (0 == fileName)
        {
            fileName = filePath;
        }
        else
        {
            fileName++;
        }

        for (cnts=0; cnts<gTrcFilterCnts; cnts++)
        {
            if (0 == strncmp(fileName, gTrcFilter[cnts],
                             strlen(gTrcFilter[cnts])))
            {
                ret = 0;
                break;
            }
        }
    }

    return ret;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_RecordPrefix                                               */
/* 功能描述: 记录TRACE信息的前缀字符串                                        */
/* 输入参数: pFile --- 指向文件名的指针                                       */
/*           line --- 当前文件的行数                                          */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-12-21              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
void TRACE_RecordPrefix(const char *pFile, U32 line)
{
    char *pos;
    U32   len;
    char  fileName[32];
    char  fnName[32];
    char  tmp[32];
    T_RTC tSysTime;

    /**************************************************************************/
    /* 获取文件名                                                             */
    /**************************************************************************/
    pos = strrchr((char *)pFile, '\\');
    if (USR_NULL == pos)
    {
        pos = strrchr((char *)pFile, '/');
        if (USR_NULL == pos)
        {
            goto EXIT_LABEL;
        }
    }

    len = strlen(pos+1);
    strncpy(fileName, pos+1, len+1);
    fileName[31] = '\0';

    /**************************************************************************/
    /* 获取函数名称、系统时间等                                               */
    /**************************************************************************/
    TRACE_GetSelfTaskName(tmp, sizeof(tmp));
    TRACE_GetFnNameInStk(tmp, fnName);

    BSP_RTCGetDateTime(&tSysTime, RTC_FMT_BIN);

#if TRC_SIO
    /**************************************************************************/
    /* 直接通过串口输出                                                       */
    /**************************************************************************/
    TRC_OUT("\r\n%-20s %-5d %02d:%02d:%02d.%03d %-16s %-24s ",
            fileName, line,
            tSysTime.hours, tSysTime.minutes, tSysTime.seconds,
            tSysTime.subseconds,
            tmp, fnName);
#endif

EXIT_LABEL:
    return;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_Entry                                                      */
/* 功能描述: TRACE入口实现                                                    */
/* 输入参数: pFile --- 指向文件名的指针                                       */
/*           line --- 文件行数                                                */
/*           pFnName --- 指向函数名称字符串的指针                             */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-12-21              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
void TRACE_Entry(const char *pFile, U32 line, const char *pFnName)
{
    BOOL res;
    T_FN_NAME *ptList;

    /**************************************************************************/
    /* 输入参数检查                                                           */
    /**************************************************************************/
    if ((USR_NULL == pFile) || (USR_NULL == pFnName))
    {
        goto EXIT_LABEL;
    }

    /**************************************************************************/
    /* 获取信号量                                                             */
    /**************************************************************************/
    res = OS_SemWait(gTrcFnNameStkMutex, WAIT_FOREVER);
    if (!res)
    {
        goto EXIT_LABEL;
    }

    /**************************************************************************/
    /* 将函数名压栈                                                           */
    /**************************************************************************/
    ptList = (T_FN_NAME *)PUB_GetUB(sizeof(T_FN_NAME));
    if (USR_NULL != ptList)
    {
        TRACE_GetSelfTaskName(ptList->taskName, sizeof(ptList->taskName));
        strncpy(ptList->fnName, pFnName, TRC_MAX_NAME_SIZE-1);
        ptList->fnName[TRC_MAX_NAME_SIZE-1] = '\0';
        ptList->pNext = gTrcNameStk;
        gTrcNameStk = ptList;
    }
    else
    {
        gTrcLevel = TRC_LVL_NO;
    }

    /**************************************************************************/
    /* 释放信号量                                                             */
    /**************************************************************************/
    OS_SemRelease(gTrcFnNameStkMutex);

    if ((TRC_LVL_NO != gTrcLevel) && (gTrcLevel <= TRC_LVL_ALL))
    {
        TRACE_RecordPrefix(pFile, line);
#if TRC_SIO
        TRC_OUT("Entry {");
#endif
    }

EXIT_LABEL:
    return;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_Exit                                                       */
/* 功能描述: TRACE出口的实现                                                  */
/* 输入参数: pFile --- 指向文件名称的指针                                     */
/*           line --- 文件行数                                                */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-12-21              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
void TRACE_Exit(const char *pFile, U32 line)
{
    BOOL res;
    T_FN_NAME *pName = USR_NULL;
    T_FN_NAME *pList = USR_NULL;
    char       taskName[32];

    /**************************************************************************/
    /* 输出TRACE信息                                                          */
    /**************************************************************************/
    TRACE_RecordPrefix(pFile, line);
#if TRC_SIO
    TRC_OUT("Exit }");
#endif

    /**************************************************************************/
    /* 获取信号量                                                             */
    /**************************************************************************/
    res = OS_SemWait(gTrcFnNameStkMutex, WAIT_FOREVER);
    if (!res)
    {
        goto EXIT_LABEL;
    }

    /**************************************************************************/
    /* 根据任务名称查找函数名栈中第一个和任务名匹配的函数名                   */
    /**************************************************************************/
    TRACE_GetSelfTaskName(taskName, sizeof(taskName));
    pName = gTrcNameStk;
    pList = gTrcNameStk;

    while (USR_NULL != pName)
    {
        if (0 == strcmp(taskName, pName->taskName))
        {
            break;
        }
        else
        {
            pList = pName;
            pName = pName->pNext;
        }
    }

    /**************************************************************************/
    /* 从函数名栈中删除函数名                                                 */
    /**************************************************************************/
    if (USR_NULL != pName)
    {
        if (gTrcNameStk == pName)
        {
            gTrcNameStk = pName->pNext;
        }
        else
        {
            pList->pNext = pName->pNext;
        }

        PUB_RetUB(pName);
        pName = USR_NULL;
    }

    /**************************************************************************/
    /* 释放信号量                                                             */
    /**************************************************************************/
    OS_SemRelease(gTrcFnNameStkMutex);

EXIT_LABEL:
    return;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_ShowBuff                                                   */
/* 功能描述: TRACE输出缓冲区数据的函数                                        */
/* 输入参数: pBuf --- 指向缓冲区的指针                                        */
/*           size --- 缓冲区大小                                              */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-11-23              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
void TRACE_ShowBuff(U8 *pBuf, U32 size)
{
    unsigned int  cnts;
    unsigned char data;

    if ((0 != pBuf) && (0 != size))
    {
        for (cnts=0; cnts<size; cnts++)
        {
            if (0 == (cnts % 8))
            {
                m_printf(DBG_COM, "\r\n%82s", " ");
            }

            data = pBuf[cnts];
            m_printf(DBG_COM, "0x%02x ", data);
        }
    }

    return;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: TRACE_HexDump                                                    */
/* 功能描述: 按指定格式输出16进制的内存数据                                   */
/* 输入参数: pBuf --- 指向缓冲区的指针                                        */
/*           size --- 缓冲区大小                                              */
/* 输出参数: 无                                                               */
/* 返 回 值: void                                                             */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2017-11-23              v0.9          maag          创建函数           */
/*<FUNC->**********************************************************************/
void TRACE_HexDump(U8 *pBuf, U32 size)
{
    const unsigned char *c = pBuf;
    unsigned int i;

    if (USR_NULL == pBuf)
    {
        goto EXIT_LABEL;
    }

    m_printf(DBG_COM, "\r\n%82s~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
                      "~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n", " ");
    m_printf(DBG_COM, "%82sOFFSET     0  1  2  3  4  5  6  7  8  9  A  B  C  D"
                      "  E  F  ASCII\r\n", " ");
    m_printf(DBG_COM, "%82s---------------------------------------------------"
                      "------------------------\r\n", " ");

    while (size > 0)
    {
        m_printf(DBG_COM, "%82s%08ph: ", " ", c);

        for (i=0; i<16; i++)
        {
            if (i < size)
            {
                m_printf(DBG_COM, "%02x ", c[i]);
            }
            else
            {
                m_printf(DBG_COM, "   ");
            }
        }

        for (i=0; i<16; i++)
        {
            if (i<size)
            {
                m_printf(DBG_COM, "%c", (c[i]>=32 && c[i] < 127) ? c[i] : '.');
            }
            else
            {
                m_printf(DBG_COM, " ");
            }
        }

        m_printf(DBG_COM, "\r\n");

        c += 16;

        if (size <= 16)
        {
            break;
        }

        size -= 16;
    }

    m_printf(DBG_COM, "%82s~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
                      "~~~~~~~~~~~~~~~~~~~~~~~~", " ");

EXIT_LABEL:
    return;
}


/******************************************************************************/
/*                                内部函数实现                                */
/******************************************************************************/

#endif


